const ARTICLE_DATA = [
  // 新しい記事を書くたびに上から項目を追加

  // 2
  {
    title: "信州Charm 5号目を発行します！",
    date: [2025, 3, 1],
    latestUpdate: [2025, 3, 1],
    staff: "かいぬま",
    main: [
      {
        head: "今号は、'山'特集",
        body: [
          {
            caption: "",
            text: "信州Charm 5号目は、メンバー12名の力を合わせて取材、記事作成、ページデザインを行いました。\n今回は、山特集！上高地、松本山雅、HIGH RAIL 1375、わんこそばの検証記事を掲載しています！",
          },
        ],
      },
      {
        head: "特集の詳細",
        body: [
          {
            caption: "上高地",
            text: "上高地への行き方、散策する際の服装、おすすめの散策ルートを掲載しています。",
          },
          {
            caption: "松本山雅特集",
            text: "観戦のススメを掲載しています。",
          },
          {
            caption: "HIGH RAIL 1375",
            text: "JR東日本観光列車のHIGH RAIL 1375について掲載しています。",
          },
        ],
      },
      {
        head: "配布先",
        body: [
          {
            caption: "長野県内各地で配布しています！",
            text: "信州大学　松本大学　佐久大学　諏訪東京理科大学　長野大学　長野県立大学\nテンホウ\n長野県内の市町村の役所",
          },
          {
            caption: "@link",
            link: "https://shinshucharm.com/install",
            link_caption: "配布場所",
            text: "詳しくはこちらからどうぞ！",
          },
        ],
      },
    ],
  },

  // 1
  {
    title: "長野県魅力発見大会議を開催します",
    date: [2025, 2, 16],
    latestUpdate: [2024, 2, 16],
    staff: "かいぬま",
    main: [
      {
        head: "長野県魅力発見大会議を開催します！",
        body: [
          {
            caption: "概要",
            text: "長野県の魅力を参加者と一緒に話し合いませんか？\n話し合った内容を信州Charmが、フリーペーパーに落とし込むというイベントになります。\n内容は以下の通りになります。",
          },
          {
            caption: "場所",
            text: "松本市勤労者福祉センター（長野県松本市）\n※4月14日まで場所は仮とさせていただきます。",
          },
          {
            caption: "時間",
            text: "13:00～16:00",
          },
        ],
      },
      {
        head: "プログラム内容",
        body: [
          {
            caption: "1. 発表セッション（15分）",
            text: "テーマ：私が感じる長野県の魅力とこれからの可能性\n長野県に移住した人、移住を検討している人、長野県の若者がそれぞれの視点から「長野県の魅力」と「今後の可能性」を発表します。\n発表者：3名程度（1人5分）",
          },
          {
            caption: "2. トークイベント（30分）",
            text: "テーマ：リアルな声を共有する対話セッション\n長野県に移住したい人、移住経験者、大学生が参加し、移住に関する本音や体験談を共有します。自由な対話形式で、参加者同士の意見交換を促します。",
          },
          {
            caption: "3. 休憩（15分）",
            text: "",
          },
          {
            caption: "4. ワークショップ（75 分）",
            text: "テーマ：市町村の魅力発見＆取材スポット選定\n参加者は指定された市町村ごとに5名ずつの班に分かれ、魅力発見と取材したい場所の選定を行います。\n班編成：5班（1班5名）\n自己紹介：1人3分\nワークショップ・話し合い：60分",
          },
          {
            caption: "5. 成果発表・クロージング（35分）",
            text: "班ごとの成果発表（1班5分 × 5班 = 25分）\n参各班が話し合いの成果を発表し、取材対象やテーマを共有します。\nクロージング（10分）\nイベントの振り返りと今後の展望を共有し、全体を締めくくります。\n※変更になる場合がございます。",
          },
          {
            caption: "6. その他",
            text: "魅力発見大会議の後に、参加者の交流会を17:00〜19:00で長野県松本市内で開催するかもしれません。",
          },
        ],
      },
      {
        head: "応募方法",
        body: [
          {
            caption: "@link",
            link: "https://forms.gle/dP7hid6D9Rt9feHp9",
            link_caption: "応募はこちらから",
            text: "応募は上のリンクからGoogleフォームにアクセスし、必要事項を記入してください！",
          },
          {
            caption: "Googleフォームの使い方がわからない方は...",
            text: "件名：【長野県魅力発見大会議】出席について\n　\n☆メールアドレス\n☆名前（フルネーム）例：信州花子\n☆名前（ひらがな）例：しんしゅうはなこ\n☆ご年齢\n☆どこからご来場なさるか　例：長野県松本市\n☆所属　例：長野県外の社会人\n☆イベント後の参加者の交流会に参加したいかの有無\n　\nを記載の上、shinshu.charm@gmail.comにメールをお送りください。",
          },
        ],
      },
    ],
  },

  // 0
  {
    title: "信州Charmの設立理由を紹介します！",
    date: [2024, 11, 9],
    latestUpdate: [2024, 11, 9],
    staff: "ひろむら",
    main: [
      {
        head: "WEBサイト開設！",
        body: [
          {
            caption: "",
            text: "この度、ウェブサイトを開設しました！\nここでは、信州Charmに関する最新情報や長野県をもっと知ることができる情報・コンテンツをお届けしていきます。",
          },
        ],
      },
      {
        head: "設立のきっかけ",
        body: [
          {
            caption: "信州Charmって？",
            text: "信州Charmは「長野県の大学生を信州人に」を目標に活動している団体です！",
          },
          {
            caption: "やりたいこと",
            text: "長野県の大学生の中で、県外出身者は約70％です。\nまた、長野県外で就職を希望している大学生の割合は約68％で、70％に近い状況となっています。\n実際、信州大学の卒業生の約60％が長野県外で就職をされており、長野県内での人材不足が深刻な問題となっています。",
          },
          {
            caption: "",
            text: "そこで、私たちはこの状況を変えたいとの思いから行動を起こすことにしました。長野県の大学の卒業生が長野県に就職や定住をすることを促し、長野県のさらなる発展に寄与したいと考えています。\nそのために長野県に来てよかったな、ここに住もうかな、このフリーペーパーを読んで生活が豊かになったなと思ってもらえるような情報を、長野県が大好きな同世代の私たちが発信しよう！と思い、フリーペーパー団体信州Charmを立ち上げました！",
          },
        ],
      },
      {
        head: "これから",
        body: [
          {
            caption: "",
            text: "ぜひ、定期的に信州Charmのウェブサイトをチェックしていただき、新しい情報を楽しんでください！\n今後とも、どうぞよろしくお願いいたします。",
          },
        ],
      },
    ],
  },

  // {
  //   title: "TITLE_sample",
  //   date: [2024, 11, 10],
  //   latestUpdate: [2024, 11, 10],
  //   staff: "すずき",
  //   main: [
  //     {
  //       head: "HEAD1 / 大見出し",
  //       body: [
  //         {
  //           caption: "caption1.1 / 小見出し",
  //           text: "1.1",
  //         },
  //       ],
  //     },
  //     {
  //       head: "HEAD2",
  //       body: [
  //         {
  //           caption: "caption2.1",
  //           text: "2.1",
  //         },
  //         {
  //           caption: "caption2.2",
  //           text: "2.2",
  //         },
  //         {
  //           caption: "caption2.3",
  //           text: "2.3",
  //         },
  //       ],
  //     },
  //     {
  //       head: "HEAD3",
  //       body: [
  //         {
  //           caption: "caption3.1",
  //           text: "3.1",
  //         },
  //       ],
  //     },
  //   ],
  // },
];

export { ARTICLE_DATA /*, Backnumber_list*/ };
